Repository: IPOleksenko/Nozomi_bot_Telegram
Catalog: locales/*/LC_MESSAGES/bot.po
Languages: ru

source: Weater_message_1
ru: Сегодня, {today} в {arguments} {detailed_status} Температура в районе {temp}°C по Цельсию

source: Weater_message_2
ru: Сейчас в {arguments} холодно, одевайся тепло

source: Weater_message_3
ru: Сейчас в {arguments} прохладно, одевайся потеплее чтобы не простудится

source: Weater_message_4
ru: В {arguments} погода прекрасная! Идём гулять

source: Weater_message_5
ru: Я не знаю такого города :( Давай посмотрим погоду в другом месте

source: Hello, I'm Nozomi! If you wanna start using me – send a /start in this chat
ru: Привет, я Nozomi! Если хочешь научиться мной пользоваться тебе надо написать: /start

source: help
ru: Команды пользователя: /start - список команд /weather {город} - бот отправляет сообщение о погоде /random {начальное число} {конечное число - 1} {шаг} — выводит случайно число /horoscope - можете посмотреть гороскоп на сегодня /donate {цена в долларах, целое число} - пожертвовать автору бота выбранную сумму Команды администратора: /TOGGLEVOICERECOGNIZER - разрешить или запретить мне переводить голосовые сообщения в текст. По умолчанию запрещено. /MESSAGE - бот отправляет сообщение Команды владельца бота: /SENDBYID {ID пользователя или чата, через пробел можно указать несколько} - берет и отправляет выбранное вами сообщение по указаному ID /SENDALL - принимает и отправляет выбранное вами сообщение всем пользователям и во все чаты /DELETE {ID группы} {ID сообщения} - удаляет сообщение которому вы ответили этой командой или ввели ID чата и ID сообщения /BAN {ID группы} {ID пользователя} - блокирует пользователя в группе которому вы ответили этой командой или указали ID группы и ID пользователя /UNBAN {ID группы} {ID пользователя} - разблокирует пользователя в группе которому вы ответили этой командой или указали ID группы и ID пользователя Также: -Бот переводит голосовые сообщения в текст -Бот сохраняет информацию -При присоединении моего владельца в чат я постараюсь выдать ему права администратора

source: {You_didnt_enter_the_city}
ru: Укажи город /weather <city>

source: Which horoscope is interesting?
ru: Какой гороскоп интересен?

source: SENDBYID_NOT_REPLY
ru: Вам нужно ответить этой командой на сообщение!

source: SENDBYID_NOT_ID
ru: Вам нужно указать ID чата или пользователя который общался со мной!

source: You are not my owner
ru: Вы не мой владелец, я не могу выполнить для вас это(

source: Think...
ru: Думаю...

source: Failed to decrypt
ru: Не удалось расшифровать

source: Sorry, an error has occurred😔
ru: Извините, произошла ошибка😔
